1. Create a pandas data frame d1 with following data

In [1]:
import pandas as pd
import numpy as np
data={'one':[0,4,8],'two':[1,5,9],'three':[2,6,10],'four':[3,7,11]}
lable=['Ohio','Colorado','New York']
df=pd.DataFrame(data,index=lable)
df4=df
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

2. Add two columns namely duplicate1, duplicate1 with data frame in question 1 and values to Columns using pandas series.

In [2]:
df1=df
new_data=df.one+df.two
df1['duplicate1']=new_data
df1['duplicate2']=new_data
df1

          one  two  three  four  duplicate1  duplicate2
Ohio        0    1      2     3           1           1
Colorado    4    5      6     7           9           9
New York    8    9     10    11          17          17

3. Drop New York row from the data frame obtained in the question 2 and store the result in DF3 And display.

In [3]:
DF3=df1.drop('New York')
DF3

          one  two  three  four  duplicate1  duplicate2
Ohio        0    1      2     3           1           1
Colorado    4    5      6     7           9           9

4. Create a pandas series with values 0-9 and provide the indexes one, two, threeâ€¦..nine.

In [4]:
s = pd.Series(np.arange(9), index=["one", "two", "three", "four", "five","six","seven","eight","nine"])
s

one      0
two      1
three    2
four     3
five     4
six      5
seven    6
eight    7
nine     8
dtype: int64

5. Perform division operation between data frame obtained in question 1 and pandas series
Obtained in question 4 and store the result in another variable.

In [5]:
new_data=df.div(s)
new_data

,duplicate1,duplicate2,eight,five,four,nine,one,seven,six,three,two
Ohio,NaN,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,NaN,1.0,1.0
Colorado,NaN,NaN,NaN,NaN,2.333333,NaN,inf,NaN,NaN,3.0,5.0
New York,NaN,NaN,NaN,NaN,3.666667,NaN,inf,NaN,NaN,5.0,9.0

6. Create NaN value with DataFrame question 1,check if a DataFrame d1 has may missing value, to replace NaNs with a single constant value in specified columns in a DataFrame.

In [6]:
result = new_data['duplicate1'].fillna(0)
spe_col=new_data.fillna(0)
display(spe_col)
print("Single coloum : \n",result)

,duplicate1,duplicate2,eight,five,four,nine,one,seven,six,three,two
Ohio,0.0,0.0,0.0,0.0,1.000000,0.0,0.0,0.0,0.0,1.0,1.0
Colorado,0.0,0.0,0.0,0.0,2.333333,0.0,inf,0.0,0.0,3.0,5.0
New York,0.0,0.0,0.0,0.0,3.666667,0.0,inf,0.0,0.0,5.0,9.0

Single coloum :
 Ohio        0.0
Colorado    0.0
New York    0.0
Name: duplicate1, dtype: float64

7. Creating a series containing two arrays of indexes (i.e., creating a structure with two levels) and swap two level.

In [7]:
list = ['one,two,three,four,five,six,seven,eight'.split(',')]
s = pd.Series(list, [[range(1,5)],[range(5,9)]]).unstack()
s

                                                  (5, 6, 7, 8)
(1, 2, 3, 4)  [one, two, three, four, five, six, seven, eight]

8. With data frame Question 1 convert into series.

In [8]:
a = df4.apply(pd.Series).stack().reset_index(drop=True)
a

0      0
1      1
2      2
3      3
4      1
5      1
6      4
7      5
8      6
9      7
10     9
11     9
12     8
13     9
14    10
15    11
16    17
17    17
dtype: int64